content/posts/yacob2020.md
+++
title = "yacob2020 | Variation compensation in machining processes using dual quaternions"
author = ["João Gutemberg Farias"]
draft = false
+++

The authors use DQ to compensate for variations in machining process. The variations are differences between the ideal/projected piece and the obtained through machining.
The common way to compensate variation is using HTM. Using DQ the modeling of the problem became easier as some steps became unnecessary obtaining the same result. Also, DQ allowed to analize other types of form error which the classical model can not analize.


## Info {#info}


## Notes {#notes}


### Resumo {#resumo}

Os autores usam quatérnios duais para compensar variações em processos de usinagem. As variações são diferenças entre o planejado e o obtido.
Esse processo é normalmente feito com HTM. Usando DQ se obteve uma simplificação na modelagem com o mesmo resultado, além disso DQ abriu caminho para analisar outros tipos de erro de forma que o modelo clássico não consegue analisar.
